Управление_закупками/src/Documents/ЛинейныйИсполнитель/ЛинейныйИсполнитель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛинейныйИсполнитель</name>
  <basedOn>Document.ВнутреннийЗаказ</basedOn>
  <registerRecords>InformationRegister.ЛинейныйИсполнительВнутреннегоЗаказа</registerRecords>
  <registerRecords>AccumulationRegister.ОстатокПотребностиПоВнутреннимЗаказам</registerRecords>
  <registerRecords>InformationRegister.ЗакупщикМатериаловВнутреннегоЗаказа</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительРабот</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупщикМатериала</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Управление_закупками/src/InformationRegisters/ЛинейныйИсполнительВнутреннегоЗаказа/ЛинейныйИсполнительВнутреннегоЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛинейныйИсполнительВнутреннегоЗаказа</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЛинейныйИсполнитель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_закупками/src/InformationRegisters/ЗакупщикМатериаловВнутреннегоЗаказа/ЗакупщикМатериаловВнутреннегоЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗакупщикМатериаловВнутреннегоЗаказа</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗакупщикМатериалов</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_закупками/src/AccumulationRegisters/ОстатокПотребностиПоВнутреннимЗаказам/ОстатокПотребностиПоВнутреннимЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстатокПотребностиПоВнутреннимЗаказам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>ВнутреннийЗаказ</name>
    <type>
      <types>DocumentRef.ВнутреннийЗаказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныеХарактеристикиНоменклатуры</name>
    <type>
      <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_закупками/src/Enums/ВидПоставки/ВидПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидПоставки</name>
  <enumValues>
    <name>Заказчиком</name>
  </enumValues>
  <enumValues>
    <name>Поставщиком</name>
  </enumValues>
</mdclass:Enum>

Управление_закупками/src/Documents/ВнутреннийЗаказ/ВнутреннийЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннийЗаказ</name>
  <registerRecords>AccumulationRegister.ОстатокПотребностиПоВнутреннимЗаказам</registerRecords>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоставки</name>
    <type>
      <types>EnumRef.ВидПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяДокументация</name>
    <type>
      <types>CatalogRef.РабочаяДокументация</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСогласованПТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказОтправленВОМТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиЗаказаВОМТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправилВОМТС</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ДополнительныеХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЗаказа</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДляКорректировки</name>
      <type>
        <types>DocumentRef.ВнутреннийЗаказ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_закупками/src/Documents/ЛинейныйИсполнитель/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
		// Заполнение шапки
		Основание = ДанныеЗаполнения.Ссылка;
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ВидПоставки") = Перечисления.ВидПоставки.Заказчиком Тогда
			
			ЗакупщикМатериала = Константы.ЗаказчикПоУмолчанию.Получить();	
			
		КонецЕсли;
		
		
	КонецЕсли;  
	
КонецПроцедуры 


Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЛинейныйИсполнительВнутреннегоЗаказа
	Движения.ЛинейныйИсполнительВнутреннегоЗаказа.Записывать = Истина;
	Движение = Движения.ЛинейныйИсполнительВнутреннегоЗаказа.Добавить();
	Движение.ВнутреннийЗаказ = Основание;
	Движение.ЛинейныйИсполнитель = ИсполнительРабот;

	// регистр ЗакупщикМатериаловВнутреннегоЗаказа
	Движения.ЗакупщикМатериаловВнутреннегоЗаказа.Записывать = Истина;
	Движение = Движения.ЗакупщикМатериаловВнутреннегоЗаказа.Добавить();
	Движение.ВнутреннийЗаказ = Основание;
	Движение.ЗакупщикМатериалов = ЗакупщикМатериала;     
	
	// регистр ОстатокПотребностиПоВнутреннимЗаказам
	ЗаписатьДвиженияВРегистрОстатокПотребностиПоВнутреннимЗаказам(Отказ);
	
КонецПроцедуры


#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьДвиженияВРегистрОстатокПотребностиПоВнутреннимЗаказам(Отказ)
	
	// Если поставка за заказчиком или за организацией движения проводить не надо.
	Движения.ОстатокПотребностиПоВнутреннимЗаказам.Записывать = Истина;  
	
	ВидПоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ВидПоставки");
	Если ЗначениеЗаполнено(ЗакупщикМатериала)
		 И Не ВидПоставки = Перечисления.ВидПоставки.Заказчиком 
		 И ТипЗнч(ЗакупщикМатериала) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутреннийЗаказТовары.Номенклатура КАК Номенклатура,
		|	ВнутреннийЗаказТовары.ЕдиницаИзмеренияЗаказа КАК ЕдиницаИзмеренияЗаказа,
		|	СУММА(ВнутреннийЗаказТовары.Количество) КАК Количество,
		|	ВнутреннийЗаказТовары.ЗаказДляКорректировки КАК ЗаказДляКорректировки,
		|	ЕСТЬNULL(ВнутреннийЗаказТовары.ДополнительныеХарактеристикиНоменклатуры, ЗНАЧЕНИЕ(Документ.ВнутреннийЗаказ.ПустаяСсылка)) КАК ДополнительныеХарактеристикиНоменклатуры
		|ИЗ
		|	Документ.ВнутреннийЗаказ.Товары КАК ВнутреннийЗаказТовары
		|ГДЕ
		|	ВнутреннийЗаказТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнутреннийЗаказТовары.Номенклатура,
		|	ВнутреннийЗаказТовары.ЕдиницаИзмеренияЗаказа,
		|	ВнутреннийЗаказТовары.ЗаказДляКорректировки,
		|	ВнутреннийЗаказТовары.ДополнительныеХарактеристикиНоменклатуры";
		
		Запрос.УстановитьПараметр("Ссылка", Основание);
		РезультатЗапроса =  Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		//Результат не может быть пустой. Ранее была проверка на заполнение табличной части. 
		
		Движения.ОстатокПотребностиПоВнутреннимЗаказам.Записывать = Истина;
		
		Пока Выборка.Следующий() Цикл
			
			Движение = Движения.ОстатокПотребностиПоВнутреннимЗаказам.Добавить(); 
			
			Если Выборка.Количество >= 0 Тогда
				
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;			
				Движение.ВнутреннийЗаказ = Основание; 
				Движение.Количество = Выборка.Количество;
				
			Иначе      
				
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.ВнутреннийЗаказ = Выборка.ЗаказДляКорректировки;
				Движение.Количество = - Выборка.Количество;   
				
			КонецЕсли;
			
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.ДополнительныеХарактеристикиНоменклатуры = Выборка.ДополнительныеХарактеристикиНоменклатуры;
			Движение.ЕдиницаИзмерения = Выборка.ЕдиницаИзмеренияЗаказа;
			
		КонецЦикла;
		
		Движения.Записать();
		
		ТекстСообщения = СтрШаблон("Закупку материалов по заказу №%1 осуществляет %2.", 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Номер"),
		ЗакупщикМатериала);		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);  
	КонецЕсли;
	
	
КонецПроцедуры  

#КонецОбласти
